<?php

namespace Database\Seeders;

use App\Models\FAQ;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class FAQSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $faqItems = [
            [
                'question' => 'آیا امکان صدور پیش فاکتور و فاکتور رسمی وجود دارد؟',
                'answer' => 'بله. شما می‌توانید یا تماس به شماره ..... و یا ارسال پیام در تلگرام به آیدی ...... ، درخواست صدور پیش فاکتور/فاکتور رسمی نمایید. (بزودی امکان صدور آنلاین فاکتور رسمی در سایت قرار داده می‌شود.)',
                'priority' => 1,
            ],
            [
                'question' => 'آیا امکان خرید اشتراک به صورت غیر آنلاین نیز وجود دارد؟',
                'answer' => 'بله. شما می‌توانید با تماس به شماره .... و یا ارسال پیام در تلگرام به آیدی ..... ، اشتراک به صورت غیرآنلاین تهیه کنید.',
                'priority' => 2,
            ],
            [
                'question' => 'آیا به تعرفه پلن‌های سایت مالیات نیز اضافه می‌شود؟',
                'answer' => 'بله. 9 درصد مالیات برارزش افزوده برروی قیمت اضافه می‌شود.',
                'priority' => 3,
            ],
            [
                'question' => 'آیا پس از خرید اشتراک می توان آن را ارتقا داد؟',
                'answer' => 'بله. وارد قسمت خرید اشتراک‌ بشوید و اشتراک مورد نظرتان را انتخاب کنید، ما‌به‌التفاوت پرداختی شما را محاسبه  و به شما اعلام می‌شود که با پرداخت آن مبلغ می‌توانید از اشتراک بالاتر برخوردار شوید.',
                'priority' => 4,
            ],
            [
                'question' => 'آیا امکان کنسل کردن اشتراک وجود دارد؟',
                'answer' => 'خیر، امکان کنسل کردن اشتراک و بازگشت وجه وجود ندارد.',
                'priority' => 5,
            ],
            [
                'question' => 'درصورت وجود مشکل و یا سوال چه راه های ارتباطی برای تماس با راستا وجود دارد؟',
                'answer' => 'شما می‌توانید از طریق شماره تلفن .... و یا آدرس ایمیل با ما در ارتباط باشید.',
                'priority' => 6,
            ],
            [
                'question' => 'داده های راستا چگونه بدست می‌آید؟',
                'answer' => 'داده‌های راستا از طریق جست‌وجو در منابع مختلف، کراول کردن و ارتباط با فعالین استارتاپی بدست می‌آید.',
                'priority' => 7,
            ],
            [
                'question' => 'دقت داده‌های جمع‌آوری شده چقدر است؟',
                'answer' => 'ما در راستا با جمع‌آوری داده‌ها از منابع مطمئن و بازبینی چندباره آن‌ها سعی می‌کنیم که احتمال خطا در داده‌ها را کمینه کنیم اما با این وجود بازهم احتمال خطا در برخی از داده‌ها وجود دارد.',
                'priority' => 8,
            ],
            [
                'question' => 'چگونه اطلاعات کسب و کار خود را در راستا ثبت کنم؟',
                'answer' => 'برای ثبت اطلاعات کسب و کار خود در راستا ابتدا وارد حساب کاربری خود شوید، سپس از طریق نوار کنار داشبورد فرم ثبت شرکت را پر کنید. اطلاعات کسب و کار شما توسط تیم راستا مورد بازبینی قرار گرفته و ظرف 24 ساعت منتشر خواهد شد.',
                'priority' => 9,
            ],
            [
                'question' => 'چگونه اطلاعات کسب و کار خود را در راستا ویرایش کنم؟',
                'answer' => 'برروی دکمه ویرایش اطلاعات در سمت چپ نوار بالایی کسب‌وکار خود کلیک کرده و فرم مربوط به ویرایش اطلاعات را تکمیل نمایید. اطلاعات کسب و کار شما در کمتر از 24 ساعت ویرایش خواهد شد.',
                'priority' => 10,
            ],
            [
                'question' => 'محدودیت تعداد کاربر به چه معناست؟',
                'answer' => 'اشتراک‌های رایگان و حرفه‌ای مخصوص یک کاربر طراحی شده‌اند. کاربر می‌تواند اکانت خود را روی یک دستگاه موبایل و یک کامپیوتر استفاده کند. در صورتی که نیاز به استفاده بیش از یک کاربر دارید می‌تواند از اشتراک سازمانی استفاده نماید.',
                'priority' => 11,
            ],
            [
                'question' => 'محدودیت تعداد بازدید صفحات به چه معناست؟',
                'answer' => 'کاربرانی که از اشتراک پایه استفاده می‌کنند، ماهانه از 15 پروفایل کسب‌وکار بازدید داشته باشند. اما کاربران اشتراک‌های حرفه‌ای و سازمانی می‌توانند به صورت نامحدود از پروفایل کسب‌وکار بازدید داشته باشند.',
                'priority' => 12,
            ],
            [
                'question' => 'محدودیت نتایج جست و جو پیشرفته به چه صورت است؟',
                'answer' => 'نتایج حاصل از جست و جو پیشرفته برای کاربران پایه و حرفه ای دارای محدودیت است و تنها 5 و 500 نتیجه جست و جو به آن‌ها نمایش داده می‌شود. برای مشاهده نامحدود نتایج نیاز است تا اشتراک سازمانی دریافت کنید.',
                'priority' => 13,
            ],
            [
                'question' => 'محدودیت خروجی در راستا اینسایت به چه صورت است؟',
                'answer' => 'به منظور دریافت خروجی نامحدود از نتایج جست و جو نیاز است تا اشتراک سازمانی تهیه کنید. کاربران حرفه ای تنها می توانند 500 سط خروجی در هر ماه دریافت کنند.',
                'priority' => 14,
            ],
        ];

        foreach ($faqItems as $item) {
            FAQ::query()->create($item);
        }
    }
}
